<?php

/**
 *
 * cmBB [Arabic]
 *
 * @copyright (c) 2016 Ger Bruinsma
 * @license GNU General Public License, version 2 (GPL-2.0)
 *
 * Translated By : Bassel Taha Alhitary <http://alhitary.net>
 */
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ACP_CATEGORIES_MANAGE'				=> 'إدارة الأقسام',
	'ACP_CATEGORIES_MANAGE_EXPLAIN'		=> 'من هنا تستطيع إضافة, تعديل أو حذف الأقسام. يجب عليك أولاً إنشاء قسم, وتغيير الإعدادات التالية.'
											. '<br />نرجوا الإنتباه: هذه الإضافة “المجلة البسيطة” تستخدم اسم القسم في الروابط URL. لذلك بعد اختيار اسم القسم, ننصح بعدم تغيير الاسم بعد ذلك لأن عنوان الرابط URL لن يتغير وفقًا لذلك.',
	'ACP_CMBB_CATEGORIES'				=> 'الأقسام',
	'ACP_CMBB_SETTING_SAVED'			=> 'تم حفظ الإعدادات بنجاح',
	'ACP_CMBB_TITLE'					=> 'المجلة البسيطة',
	'ACP_MIN_TITLE_LENGTH'				=> 'الحد الأدنى لطول العنوان',
	'ACP_MIN_TITLE_LENGTH_EXPLAIN'		=> 'الحد الأدنى لطول عناوين المقالات',
	'ACP_MIN_CONTENT_LENGTH'			=> 'الحد الأدنى لطول المحتوى',
	'ACP_MIN_CONTENT_LENGTH_EXPLAIN'	=> 'الحد الأدنى لطول محتوى المقالة (جسم المقالة). يمنع المقالات المطولة.',
	'ACP_NO_ARTICLES'					=> 'ليس لديك مقالات (نشطة). عليك إنشاء مقالة جديدة باستخدام الرابط أدناه:',
	'ACP_NUMBER_INDEX_ITEMS'			=> 'عدد العناصر بالصفحة الرئيسية',
	'ACP_NUMBER_INDEX_ITEMS_EXPLAIN'	=> 'أقصى عدد لأحدث العناصر من أجل عرضها في الصفحة الرئيسية. يتم ترتيب العناصر بحسب التاريخ (الأحدث في الأعلى)',
	'ACP_REACT_FORUM_ID'				=> 'المنتدى',
	'ACP_REACT_FORUM_ID_EXPLAIN'		=> 'سيتم عمل نسخة للمقالة كموضوع في المنتدى الذي تحدده هنا من أجل إتاحة التعليقات على الموضوع. لن يتم إضافة نسخة للمقالات في المنتدى إذا حددت الخيار “تعطيل التعليقات” من القائمة المنسدلة وستكون المقالة متوفرة فقط في “المجلة البسيطة”. عند حذف نسخة الموضوع في المنتدى, لن يتم حذف المقالة في المجلة.',
	'ACP_SHOW_MENUBAR'					=> 'عرض شريط القائمة',
	'ACP_SHOW_MENUBAR_EXPLAIN'			=> 'يتم إضافة شريط القائمة إلى الترويسة, ويحتوي هذا الشريط على جميع الأقسام التي لديها مقالات إلى جانب الصفحة الرئيسية (إن وجدت), قائمة المنتديات و اتصل بنا (إذا تم تفعيلها).',
	'ACP_SHOW_RIGHTBAR'					=> 'إظهار الشريط الجانبي الأيمن',
	'ACP_SHOW_RIGHTBAR_EXPLAIN'			=> 'تستطيع اختيار عرض الشريط الجانبي على الجهة اليمين, يحتوي على أي أكواد تريدها بلغة الـ HTML. مفيدة للإعلانات أو أي محتوى آخر قد ترغب في عرضه.',
	'ACP_RIGHTBAR_HTML'					=> 'محتوى الشريط الجانبي الأيمن.',
	'ACP_RIGHTBAR_HTML_EXPLAIN'			=> 'إذا تم تفعيل الشريط الجانبي الأيمن, فسيتم عرض المحتوى الذي تم إدخاله هنا. تستطيع استخدام أي أكواد تريدها بلغة الـ HTML/JS, ولكن تأكد فقط من صحة الأكواد المدخلة.',
	'CHILDREN'							=> 'عدد المقالات',
	'CHILDREN_EXPLAIN'					=> 'عدد المقالات في هذا القسم',
	'CMBB_CATEGORY_NAME_INVALID'		=> 'إسم القسم غير صالح',
	'CMBB_SETTINGS'						=> 'الإعدادات',
	'CMBB_DELETE_CAT_EXPLAIN'			=> 'يمكن حذف القسم فقط عندما لا يحتوي على أي مقالات',
	'CREATE_CATEGORY'					=> 'إضافة قسم',
	'ERROR_CATEGORY_NOT_EMPTY'			=> 'القسم غير فارغ',
	'ERROR_FAILED_DELETE'				=> 'فشل في الحذف.',
	'NO_REACTIONS'						=> 'تعطيل التعليقات',
	'PROTECTED'							=> 'مَحمِي',
	'PROTECTED_EXPLAIN'					=> 'السماح للمشرفين فقط بالنشر',
	'SHOW_MENU_BAR'						=> 'إظهار في شريط القائمة',
	'SHOW_MENU_BAR_EXPLAIN'				=> 'تحديد عدم / إظهار هذا القسم في شريط القائمة (في كل الحالات يظهر فقط عندما يحتوي القسم على مقالات). من المفيد تعطيله إذا كنت لا تحب إضافة القسم في القائمة أو لديك فقط بعض المقالات قيد المراجعة.',

		));
